{
  "1-The Muslim Family": {
    "books": [
      {
        "binding": "paperback",
        "description": "This book covers the importance and advantages of marriage and explains the process of selecting a spouse, the marriage contract, celebrating the wedding, the waleemah, and more. It provides a practical procedure for performing a marriage contract, and includes a sample marriage certificate.",
        "isbn": "1-891229-51-6",
        "pages": "204",
        "price": "$10.00",
        "published_date": "2002",
        "slug": "quest_for_love",
        "title": "The Quest for Love & Mercy – Marriage & Wedding, Rev Ed"
      },
      {
        "binding": "paperback",
        "description": "This book covers the proper etiquettes of marital intimacy, forbidden acts of intimacy, zinaa, birth control, etc. Answers many frequently asked questions about various acts of intimacy.",
        "isbn": "1-891229-52-4",
        "pages": "192",
        "price": "$10.00",
        "published_date": "2000",
        "slug": "closer_than_garment",
        "title": "Closer than a Garment – Marital Intimacy, Rev Ed"
      },
      {
        "binding": "paperback",
        "description": "This book covers the obligations of the two spouses: the wife's rights, and the husband's rights. Contains biographies of the Mothers of the Believers, paints very realistic pictures from the life of the Prophet (Peace be Upon Him) with his wives, and presents a complete discussion of the hadeeth of Umm Zar'.",
        "isbn": "1-891229-53-2",
        "pages": "190",
        "price": "$10.00",
        "published_date": "2000",
        "slug": "fragile_vessels",
        "title": "The Fragile Vessels – Marital Rights & Obligations, Rev Ed"
      },
      {
        "binding": "paperback",
        "description": "As a logical continuation to the previous three books, this sequel deals with the normal fruit of marriage: babies. It covers the Islamic regulations relating to a newborn. This includes welcoming the baby, naming it, shaving its hair, circumcising it, and slaughtering the sacrificial 'aqiqah. The discussion of naming the newborn covers the recommended and prohibited names, nicknames, and kunyahs. It is further enhanced with tho appendices that list Allah's authentic excellent names, as well as a large number of suggested Islamic names for both genders. The discussion of 'aqiqah includes its ruling, animals to be slaughtered, dispensing of the meat, the 'aqiaqah's feast, and the 'aqiqah's wisdom. The discussion of circumcision includes the circumcision process, its ruling for boys and girls, its benefits, and expressiveness and other violations. Other discussions include tahnik, shaving the baby's head, piercing the ears, breast-feeding, protection from the evil eye, babies' toys and clothes, birthdays, and so on. We intended - and we believe that we largely succeeded - in making this book a complete reference covering the correct Islamic acts that parents need to perform for their newborn during its first few weeks. All praise is due to Allah.",
        "isbn": "1-891229-54-0",
        "pages": "269",
        "price": "$13.00",
        "published_date": "2002",
        "slug": "sprouts",
        "title": "Our Precious Sprouts – Regulations for Newborns, 2nd Ed, HB"
      }
    ],
    "description": "This first three books in the series cover various aspects of marriage according to the authentic Sunnah. Marriage plays a most central role in the human life, and has been largely discussed by the scholars of Islam through the ages, resulting in numerous writings and treatises. Some of those writings, mostly by contemporary scholars, have been translated to English. However, we find them restricted in scope, addressing Muslims who live in predominantly Islamic countries, or overlooking important real issues that have developed under the modern civilization. This leaves quite a large gap that needs to be filled for the benefit of the Muslims in English-speaking countries, and this is what we attempt to fulfill over the span of three books. The final book in the series is a logical continuation to this topic, which deals with the normal fruit of marriage-- babies."
  },
  "2-Iman Made Easy": {
    "books": [
      {
        "binding": "paperback",
        "description": "This series addresses the Muslim children as well as newcomers to Islam, in the West. In six books, it covers the six pillars of Eemaan and related subjects. Each book is structured into chapters and sections to enhance learning and help present the concepts in a way suitable for children at the elementary-school level. Each chapter includes exercises to emphasize the concepts, making it easy to use these books as reading and study material in schools.",
        "isbn": "1-891229-82-6",
        "pages": "134",
        "price": "$9.00",
        "published_date": "2002",
        "slug": "knowing_allah",
        "title": "Knowing Allāh, 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "This multi colored book about the Angels has been divided into many sections. The book describes the nature of Angels, what they do, and specific Angels we recognize by name.This series addresses the Muslim children in the West. In six books, it covers the six pillars of Eemaan and related subjects. Each book is structured into chapters and sections to enhance learning and help present the concepts in a way suitable for children at the elementary-school level. Each chapter includes exercises to emphasize the concepts, making it easy to use these books as reading and study material in schools.",
        "isbn": "1-891229-83-4",
        "pages": "144",
        "price": "$9.00",
        "published_date": "2003",
        "slug": "knowing_angels",
        "title": "Knowing the Angels, 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "This series addresses Muslim children in the west. In six books, it covers the six pillars of Eemaan and related subjects. This multi colored book about Allah's books and the Qur'an is structured into chapters and sections to enhance learning and help present the concepts in a way suitable for children at the elementary-school level. Each chapter includes exercises to emphasize the concepts, making it easy to use these books as reading and study material in schools.\n\n",
        "isbn": "1-891229-84-2",
        "pages": "124",
        "price": "$9.00",
        "published_date": "2007",
        "slug": "knowing_books",
        "title": "Knowing Allāh’s Books & the Qur’ān, Rev 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "This series addresses Muslim children as well as newcomers to Islam. In six books, it covers the six pillars of Eemaan and related subjects. Each book is structured into chapters and sections to enhance learning and help present the concepts in a way suitable for children at the elementary-school level. Each chapter includes exercises to emphasize the concepts, making it easy to use these books as reading and study material in schools.",
        "isbn": "1-891229-08-7",
        "pages": "127",
        "price": "$9.00",
        "published_date": "2003",
        "slug": "knowing_prophets",
        "title": "Knowing Allāh’s Prophets & Messengers"
      },
      {
        "binding": "paperback",
        "description": "This is a simplified series of books dealing with the fundamental Islaamic beliefs. The material is well-founded on authentic proofs from the Qur'aan and Sunnah. The books are written in easy language, making them accessible to individuals with limited vocabulary. Each book is structured into chapters, sections, and subsections to enhance learning and facilitate grasping the concepts by elementary-level readers. Furthermore, each chapter includes exercises to review and emphasize these concepts. All of this makes the Eemaan Made Easy series a valuable source of reliable study material for schools and individuals.",
        "isbn": "1-891229-09-5",
        "pages": "216",
        "price": "$12.00",
        "published_date": "2004",
        "slug": "knowing_last_day",
        "title": "Knowing the Last Day"
      },
      {
        "binding": "paperback",
        "description": "This is a simplified series of books dealing with the fundamental Islamic beliefs. The material is well-founded on authentic proofs from the Qur'aan and Sunnah. The books are written in easy language, making them accessible to individuals with limited vocabulary. Each book is structured into chapters, sections, and subsections to enhance learning and facilitate grasping the concepts by elementary-level readers. Furthermore, each chapter includes exercises to review and emphasize these concepts. All of this makes the Eemaan Made Easy series a valuable source of reliable study material for schools and individuals.\n\"Believing in Allah's Decree; Qadar\"",
        "isbn": "1-891229-10-9",
        "pages": "247",
        "price": "$12.00",
        "published_date": "2004",
        "slug": "qadar",
        "title": "Believing in Allāh’s Decree, Qadar"
      }
    ],
    "description": "This is a simplified series of books dealing with the fundamental Islamic beliefs. The material is well-founded on authentic proofs from the Qur'aan and Sunnah. The books are written in easy language, making them accessible to individuals with limited vocabulary."
  },
  "3-The Inevitable Journey": {
    "books": [
      {
        "binding": "hardcover",
        "description": "This book is the first in the series. It deals with sickness, which continues to afflict human beings from birth until death. Sickness strikes as light as a simple cold or allergy, and as hard as a plague or cancer. It keeps the human being in check, reminding him of his weakness and giving him a chance to turn to the One who possesses the ability to afflict and cure. This book deals with sickness, its regulations, and lessons associated with it. It presents the Islamic stance on a number of modern medical issues, and also discusses important regulations relating to those with disabilities.",
        "isbn": "1-891229-78-8",
        "pages": "327",
        "price": "$15.00",
        "published_date": "2003",
        "slug": "sickness",
        "title": "Sickness, Regulations & Exhortations, 2nd Ed, HB"
      },
      {
        "binding": "hardcover",
        "description": "We inevitably go through a journey starting in this life, and extending into the grave, before our final abode in the hereafter. In the process, we pass through stages of sickness, death, and the intermediate life in the grave (al-Barzakh). Writing a will is a religious obligation on every capable Muslim. It protects against many problems and conflicts that could arise after a persons death. This obligation is more emphasized in the west; Failing to write a well founded will may result in the distribution of ones estate in discord with the Islamic law, and may lead to losses for some of the rightful inheritors.",
        "isbn": "1-891229-79-6",
        "pages": "175",
        "price": "$12.00",
        "published_date": "2006",
        "slug": "inheritance",
        "title": "Inheritance, Regulations & Exhortations, 2nd Ed, HB"
      },
      {
        "binding": "paperback",
        "description": "This is a complete Islamic will & testament, with charts for inheritance, Qur'anic injunctions as well as Shari'ah compliant procedures, dos and don'ts, and more.",
        "isbn:": "",
        "pages": "32",
        "price": "$3.00",
        "published_date": "2012",
        "slug": "will",
        "title": "Islāmic Will & Testament, 2nd Ed"
      },
      {
        "binding": "hardcover",
        "description": "We inevitably go through a journey starting in this life, and extending into the grave, before our final abode in the hereafter. In the process, we pass through stages of sickness, death, and the intermediate life in the grave (al-Barzakh). These are the subjects with which \"The Inevitable Journey\" deals over a sequence of four titles: I. Sickness: Regulations & Exhortations II. The Islamic Will & Testament III. Funeral Regulations IV. Life in al-Barzakh. This book is the third in the series. It deals with the actual occurrence of death, and all lessons and regulations relating to it. It includes a close-to-complete translation of al-Albani's Ahkaam ul-Janaa'iz. In addition, it contains extensive supplementary material and an enhanced presentation with tables and diagrams, making it a useful handbook, reference, and exhortation concerning death. We believe that this is the first book in English presenting this material, based on purely authentic evidence, to this level of depth, breadth, and practicality. Indeed, we praise and give thanks to Allah (SWT) for facilitating this.",
        "isbn": "1-891229-80-X",
        "pages": "326",
        "price": "$15.00",
        "published_date": "2003",
        "slug": "funerals",
        "title": "Funerals, Regulations & Exhortations, 2nd Ed, HB"
      },
      {
        "binding": "hardcover",
        "description": "This book is the fourth in the series. It deals with many important matters that have always perplexed the human mind, but that, as is shown in this book, have been clearly explained in the authentic texts from Allah's Book and His Messenger's Sunnah. Among the subjects covered are the following: The Moment of Death, The Soul's Trip to the Heavens, The Final Test, The Righteous and the Sinful in al-Barzakh, Saviors from the Grave's Punishment, Communications in al-Barzakh, ThingsThat Benefit the Dead.",
        "isbn": "1-891229-81-8",
        "pages": "269",
        "price": "$14.00",
        "published_date": "2007",
        "slug": "barzakh",
        "title": "Life in al-Barzakh, from Death until Resurrection, 2nd Ed, HB"
      },
      {
        "binding": "hardcover",
        "description": "This book starts by presenting a spiritual understanding of sleep from the Islamic viewpoint, which is followed by guidelines for recommended evening, pre-sleep, night, and morning acts of worship. The conceptual understanding of dreams is laid out next, followed by an analytical study of dreams in the Quran, and of dreams seen by the Prophet Muhammad (PBUH) and by his companions (R). The rest of the book deals with dream interpretation, its correct rules and procedures, drills to help understand these rules, and a large glossary of interpreted dream symbols. This, we hope, fulfills two important goals regarding sleep and dreams: It establishes their understanding upon the strong foundation of the Quran and Sunnah, and it eliminates a great deal of superstition that surrounds them. Indeed, from Allah (SWT) alone we seek help and acceptance.",
        "isbn": "1-891229-11-7",
        "pages": "360",
        "price": "$16.00",
        "published_date": "2007",
        "slug": "dreams",
        "title": "The Dreamer’s Handbook, Sleep Etiquettes & Dream Interpretation, HB"
      }
    ],
    "description": "We inevitably go through the journey starting in this life, and extending into the grave, before our final abode in the hereafter. In the process, we pass through stages of sickness, death, and the intermediate life in the grave (al-Barzakh)."
  },
  "4-Enter into Islam Completely": {
    "books": [
      {
        "binding": "paperback",
        "description": "This book deals with the traits of fitrah which are among the issues that some people consider \"small\" or \"minor\". However, they are all very important for a Muslim who wishes to maintain healthy hygiene and a dignified appearance, guided in that by Allah's revelation, In addition to the beard, we deal in detail with the issues of grooming the hair, siwak, circumcision, and so on.",
        "isbn:": "",
        "pages": "111",
        "price": "$7.00",
        "published_date": "2008",
        "slug": "beard",
        "title": "The Beard and Other Traits of Fitrah, 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "This book deals with smoking, which has entered into the houses of Muslims in a most devastating manner. What makes this problem worse is that many Muslims do not admit to the prohibition of smoking and its danger. When they are advised about it, they quickly echo a common misunderstanding: \"But it is not Prohibited - it is only disliked!\"  This book presents a clear picture of smoking , and a detailed reasoning from the Qur'an and Sunnah for its prohibition.",
        "isbn:": "",
        "pages": "174",
        "price": "$10.00",
        "published_date": "2012",
        "slug": "smoking",
        "title": "Smoking, Intoxicants, & Narcotics, 2nd Ed, FB"
      },
      {
        "binding": "paperback",
        "description": "This book presents a sound and comprehensive Islamic understanding of birth prevention and other related issues. It first establishes the Islamic view of procreation. This is followed by an overview of birth prevention methods, old and modern. Next, it sets important guidelines for understanding rulings related to birth prevention. Finally, it presents the regulations regarding each birth prevention method, including abortion.\n\nOur discussions and conclusions are founded on clear proofs from the Quran and Sunnah, and are documented with relevant quotes from eminent Islamic scholars. This should make them both enlightening and convincing to the readers.\n\nThis book, we hope, will provide many Muslims with a better understanding and a more cautious approach toward birth prevention. May Allāh(I) grant us guidance and facilitation.",
        "isbn": "1-891229-93-1",
        "pages": "126",
        "price": "$8.00",
        "published_date": "2008",
        "slug": "birth_prevention",
        "title": "Birth Prevention; an Islāmic Perspective, 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "A normal woman spends about one quarter of her life in a state of menses or post-natal bleeding. During those times, a woman is physically and emotionally stressed. She needs special guidelines to help her conduct her religious and daily life properly and satisfactorily. Islam, being the final and most complete religion, thoroughly covers and wisely directs all aspects of the human life. Therefore, it is no wonder that it deals with menses issues in a clear and sympathetic manner. When the Islaamic regulations of menses are well understood and correctly implemented, they make it easy for a woman to conduct her close-to-illness menstrual cycle in a smooth and balanced manner. Because of this, we find it necessary to reestablish the correct Islaamic teachings regarding various menses issues. Thus, we offer to our readers the present book, in hopes that it will help shed light on and guide many Muslim women to a fulfilling and practical spiritual life during menses. \n",
        "isbn": "1-891229-94-X",
        "pages": "127",
        "price": "$8.00",
        "published_date": "2007",
        "slug": "menses",
        "title": "Regulations of Worship During Menses, 2nd Ed"
      }
    ],
    "description": "'Enter into Islam Completely' is a series regarding important fiqh issues which many of us disregard or belittle."
  },
  "5-Fiqh Handbooks": {
    "books": [
      {
        "binding": "paperback",
        "description": "Festivals and celebrations are occasions of joy and happiness. They have their distinctive spirit in all societies and cultures, and are eagerly awaited and heartily welcomed by everyone.\n\nThe feeling of excitement associated with these occasions, however, causes people to introduce un-Islamic practices during them.\n\nIslam regulates the occasions to be celebrated and the methods of celebrating them. This book discusses the two annual Islaamic festivals: Eid ul-Fitr and Eid ul-Adhaa as well as the weekly Jumu'ah. It presents the Islaamic guidelines for celebrations according to the Quraan and Sunnah, and warns against innovated occasions and un-Islaamic festivals.\n\nIn addition to topics that are standard to 'Id celebration, such as the 'Id prayer and khutbah, and 'Id pastimes, this book discusses zakat-ul-fitr, the sacrifice, the blessed days of the month of Thul-Hijjah, and many other 'Id-related issues.\n\nThe broad and thorough discussions in this book make it an important manual and complete reference on festivals and celebrations in Islam. Indeed, from Allah (swt) we seek help and acceptance.",
        "isbn": "1-891229-23-0",
        "pages": "272",
        "price": "$13.00",
        "published_date": "2005",
        "slug": "festivals",
        "title": "Festivals & Celebrations in Islām, 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "With Allah's help, and in line with our goal of promoting authentic Islamic knowledge, we present this book. It deals with a largely misunderstood, though much needed subject, both in Ramadan and around the year: that of voluntary night prayers, or qiyam. This book has two main objectives: Providing a complete manual on the subject of qiyam and related issues in accordance with the Qur'an, the Sunnah, and the guidance of the Salaf, and, in the process, presenting to the English reader two important works by the great scholar Muhammad Nasir ud-Deen al-Albani: Salat ut-Tarawih and Qiyam Ramadan. This book is not for Ramadan only, rather, it is for every night. It is the type of reference that you will want to keep by your pillow at night, and grab as soon as you get up in the wee hours to pray. It is a gift that is sure to please and benefit - inshaa'llaah.",
        "isbn": "1-891229-22-2",
        "pages": "195",
        "price": "$10.00",
        "published_date": "2002",
        "slug": "qiyam",
        "title": "The Night Prayers: Qiyām & Tarāwīh, 2nd Ed"
      }
    ],
    "description": "Books dealing in depth with specific fiqh issues."
  },
  "6-Other titles": {
    "books": [
      {
        "binding": "paperback",
        "description": "This book is instrumental in explaining the true Methodology of adherence to Allaah’s Book, His Messenger’s Sunnah, and the Guidance of the sahaabah. True to his well-known insightful approach in delving into the texts, Ibn ul-Qayyim starts by explaining the qualities of righteousness and piety that are required from everyone, both in practice and in da‘wah. He then proceeds to describe the true meaning of migration to Allaah and His Messenger, discussing in the process full submission to the Messenger’s Sunnah as an integral requirement of Eemaan. He then goes on to deliberate on the situations of true misery and true happiness.\n\nToward the end, he stipulates the requirements of the Journey of Migration, presenting along the way some very important insights for sound comprehension of the Qur’aan. In addition to its valuable methodological coverage, this book is very touching in its address to the soul and heart. This is a characteristic that you rarely find in writings of other authors. May Allaah reward Ibn ul-Qayyim profusely.",
        "isbn": "1-891229-61-3",
        "pages": "136",
        "price": "$9.00",
        "published_date": "2007",
        "slug": "tabuk",
        "title": "The Spiritual Journey (at-Tabūkiyyah), Rev 2nd Ed"
      },
      {
        "binding": "paperback",
        "description": "This series of books relates stories of outstanding moral and educational value. The stories are exclusively taken from texts of the Qur’an and the authentic Sunnah. The narrations are enhanced by extensive remarks and commentaries, and are supplemented with important conclusions and lessons. This series provides excellent reading material for Muslims at large and Muslim youth in particular. Whereas the language and discussion level target individuals who have completed elementary school, teachers may also find this series useful for reading to elementary school students. This particular book presents amazing aspects and details of the story of the noble prophet Ibrahim. Ibrahim’s sublime character and exemplary righteousness made him indeed a perpetual guide for multitudes of people, and a man who equaled a nation, rather: nations.",
        "isbn": " 1-891229-41-9",
        "pages": "184",
        "price": "$10.00",
        "published_date": "2003",
        "slug": "ibrahim",
        "title": "Ibrāhīm, a Nation in One Man"
      },
      {
        "binding": "paperback",
        "description": "This series of books relates stories of outstanding moral and educational value. The stories are exclusively taken from texts of the Qur’an and the authentic Sunnah. The narrations are enhanced by extensive remarks and commentaries, and are supplemented with important conclusions and lessons. This series provides excellent reading material for Muslims at large and Muslim youth in particular. Whereas the language and discussion level target individuals who have completed elementary school, teachers may also find this series useful for reading to elementary school students. This particular book presents amazing aspects and details of the story of our father, the noble prophet Adam.",
        "isbn": " 1-891229-41-9",
        "pages": "215",
        "price": "$11.00",
        "published_date": "2009",
        "slug": "adam",
        "title": "Ādam, Father of Humanity"
      }
    ],
    "description": "Assorted titles by K&S Publications"
  }
}